In [27]:
import io
import pandas as pd

In [28]:
data = u"""name|age|heigh
lily|28|168
lucy|8|120
sun||161
vincent|32|
"""

In [29]:
d = pd.read_table(io.StringIO(data),sep='|')

In [30]:
d

      name   age  heigh
0     lily  28.0  168.0
1     lucy   8.0  120.0
2      sun   NaN  161.0
3  vincent  32.0    NaN

In [31]:
d.columns.str.startswith('a')

array([False,  True, False], dtype=bool)

In [32]:
mask = d.columns.str.startswith('a')
d.iloc[:,mask]

    age
0  28.0
1   8.0
2   NaN
3  32.0

# Filter rows

In [33]:
mask = d.age < 10

In [34]:
d[mask]

   name  age  heigh
1  lucy  8.0  120.0

In [35]:
mask2 = d.name.str.contains('l')

In [36]:
d[mask2]

   name   age  heigh
0  lily  28.0  168.0
1  lucy   8.0  120.0

# using function to filer

In [37]:
def greater_than_10(val):
    return val>10

mask = d.age.apply(greater_than_10)
mask

0     True
1    False
2    False
3     True
Name: age, dtype: bool

In [38]:
d[mask]

      name   age  heigh
0     lily  28.0  168.0
3  vincent  32.0    NaN

# deal with nan

In [39]:
d

      name   age  heigh
0     lily  28.0  168.0
1     lucy   8.0  120.0
2      sun   NaN  161.0
3  vincent  32.0    NaN

In [40]:
d.isnull()

    name    age  heigh
0  False  False  False
1  False  False  False
2  False   True  False
3  False  False   True

In [41]:
d.age.isnull()

0    False
1    False
2     True
3    False
Name: age, dtype: bool

In [42]:
d[-d.age.isnull()]

      name   age  heigh
0     lily  28.0  168.0
1     lucy   8.0  120.0
3  vincent  32.0    NaN

In [43]:
d.fillna(-1)

      name   age  heigh
0     lily  28.0  168.0
1     lucy   8.0  120.0
2      sun  -1.0  161.0
3  vincent  32.0   -1.0

In [45]:
d["heigh"] = d.heigh.fillna("missing")

In [46]:
d

      name   age    heigh
0     lily  28.0      168
1     lucy   8.0      120
2      sun   NaN      161
3  vincent  32.0  missing

In [47]:
d.dropna()

      name   age    heigh
0     lily  28.0      168
1     lucy   8.0      120
3  vincent  32.0  missing

In [48]:
d

      name   age    heigh
0     lily  28.0      168
1     lucy   8.0      120
2      sun   NaN      161
3  vincent  32.0  missing